/*1. Explain the purpose of the main function in Dart.
it is the point of start program

2. Describe the difference between var, dynamic, and explicitly typed variables in Dart.
VAR ده كي ورد بتسمح  انى احط نوع داتا تيب مره واحده ومينفعش اغيره تانى 
DYNAMIC ده بتستخدم لما لكون مش عارف ايه نوع الداتا اللى هخزنها بمعنى تقدر تستقبل ارقام صحيحه او  ارقام عشريه او حتى نصوص وينفع ف الاول تبع رقم صحيح وبعدها اغيرها لرقم عشري او العكس لانى نوع داتا 
اما انواع الداتا اللى زي ارقام صحيحه هاو ارقام عشريه او حتى نصي دول من الاول بيحددوا نوع المتغير هيبقى ايه ويعتر دول اقوياء من حيث الامان بمعنى لو انا حاطط متغير نوع الداتا بتاعته رقم صحيح محدش يقدر يحطلى رقم عشري */
